Practical No: 2	Aim:  Implementation of BGP using AS_path attribute.

---------------------------------------------------------------------------

   R1
R2    R3

R2 (AS200) R1 (AS100) R3(AS300)

R2 (s1/0) R1 (s1/1) R3

lo0- R1 (10.1.1.0/24) R2 (10.2.2.0/24) R3 (10.3.3.0/24)

R2 (192.168.1.0/24) R1 (172.24.1.0/24) R3
------------------------------------------------------------------

Step1: Configuration

R1# conf t
int s1/0
ip add 192.168.1.1 255.255.255.0
no sh

int s1/1
ip add 172.24.1.1 255.255.255.0
no sh
---------------------------------------------------------------------------

R2# conf t
int s1/0
ip add 192.168.1.2 255.255.255.0
no sh
---------------------------------------------------------------------------


R3# conf t
int s1/1
ip add 172.24.1.3 255.255.255.0
no sh
---------------------------------------------------------------------------

Step2: Loopback

R1# int lo0
ip add 10.1.1.1 255.255.255.0
---------------------------------------------------------------------------

R2# int lo0
ip add 10.2.2.2 255.255.255.0
---------------------------------------------------------------------------

R3# int lo0
ip add 10.3.3.3 255.255.255.0
---------------------------------------------------------------------------

Step3: Configure as-bgp

R1# router bgp 100
neighbor 192.168.1.2 remote-as 200
neighbor 172.24.1.3 remote-as 300
network 10.1.1.0 mask 255.255.255.0
---------------------------------------------------------------------------

R2# router bgp 200
neighbor 192.168.1.1 remote-as 100
network 10.2.2.0 mask 255.255.255.0
---------------------------------------------------------------------------

R3# router bgp 300
neighbor 172.24.1.1 remote-as 100
network 10.3.3.0 mask 255.255.255.0
---------------------------------------------------------------------------

ON ALL ROUTERS:

do sh ip route
---------------------------------------------------------------------------
Step4: ping routers

R2#do ping 10.3.3.3 source lo0

R3#do ping 10.2.2.2 source lo0