Connected to Dyna
Press ENTER to ge

R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#int f0/1
R1(config-if)#ip add 192.168.1.1 255.255.255.0
R1(config-if)#no sh
R1(config-if)#
R1(config-if)#
*Mar  1 00:02:43.203: %LINK-3-UPDOWN: Interface FastEthernet0/1, changed state to up
*Mar  1 00:02:44.203: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up
R1(config-if)#int s1/0
R1(config-if)#ip add 172.16.1.1 255.255.255.0
R1(config-if)#no sh
R1(config-if)#
R1(config-if)#
*Mar  1 00:03:07.383: %LINK-3-UPDOWN: Interface Serial1/0, changed state to up
R1(config-if)#
*Mar  1 00:03:08.387: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/0, changed state to up
R1(config-if)#int s1/1
R1(config-if)#ip add 172.16.5.1 255.255.255.0
R1(config-if)#no sh
R1(config-if)#
*Mar  1 00:03:31.703: %LINK-3-UPDOWN: Interface Serial1/1, changed state to up
R1(config-if)#
*Mar  1 00:03:32.707: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/1, changed state to up
*Mar  1 00:03:33.103: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/0, changed state to down
R1(config-if)#
R1(config-if)#exit
R1(config)#so
*Mar  1 00:03:53.151: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/1, changed state to down
R1(config)#do sh ip int br | include up
FastEthernet0/1            192.168.1.1     YES manual up                    up
Serial1/0                  172.16.1.1      YES manual up                    down
Serial1/1                  172.16.5.1      YES manual up                    down
R1(config)#do sh ip int br | include up
FastEthernet0/1            192.168.1.1     YES manual up
Serial1/0                  172.16.1.1      YES manual up
Serial1/1                  172.16.5.1      YES manual up
R1(config)#
*Mar  1 00:05:33.083: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/0, changed state to up
R1(config)#
*Mar  1 00:06:43.131: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/1, changed state to up
R1(config)#
R1(config)#
R1(config)#router bgp 65100
R1(config-router)#network 192.168.1.0
R1(config-router)#network 172.16.1.0 mask 255.255.255.0
R1(config-router)#network 172.16.5.0 mask 255.255.255.0
R1(config-router)#neighbor 172.16.1.2 remote-as 65200
R1(config-router)#neighbor 172.16.5.3 remote-as 65200
R1(config-router)#do sh ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

     172.16.0.0/24 is subnetted, 2 subnets
C       172.16.5.0 is directly connected, Serial1/1
C       172.16.1.0 is directly connected, Serial1/0
C    192.168.1.0/24 is directly connected, FastEthernet0/1
R1(config-router)#
*Mar  1 01:33:22.643: %BGP-5-ADJCHANGE: neighbor 172.16.1.2 Up
R1(config-router)#
*Mar  1 01:34:30.791: %BGP-5-ADJCHANGE: neighbor 172.16.5.3 Up
R1(config-router)#
R1(config-router)#
R1(config-router)#do ping 192.168.3.3

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.3.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 20/28/32 ms
R1(config-router)#
R1(config-router)#
R1(config-router)#do ping 192.168.2.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.2.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 28/29/32 ms
R1(config-router)#
