Connected to Dynamips VM "R3" (ID 2, type c3725) - Console port
Press ENTER to get the prompt.

R3#
R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#int f0/0
R3(config-if)#ip add 10.10.10.3 255.255.255.0
R3(config-if)#no sh
R3(config-if)#
*Mar  1 00:05:06.839: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar  1 00:05:07.839: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
R3(config-if)#
R3(config-if)#int f0/1
R3(config-if)#ip add 192.168.3.3 255.255.255.0
R3(config-if)#no sh
R3(config-if)#
*Mar  1 00:05:20.271: %LINK-3-UPDOWN: Interface FastEthernet0/1, changed state to up
*Mar  1 00:05:21.271: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up
R3(config-if)#
R3(config-if)#int s1/1
R3(config-if)#ip add 172.16.5.3 255.255.255.0
R3(config-if)#no sh
R3(config-if)#
*Mar  1 00:05:33.883: %LINK-3-UPDOWN: Interface Serial1/1, changed state to up
R3(config-if)#
*Mar  1 00:05:34.887: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/1, changed state to up
R3(config-if)#
R3(config-if)#do sh ip int br | include up
FastEthernet0/0            10.10.10.3      YES manual up
FastEthernet0/1            192.168.3.3     YES manual up
Serial1/1                  172.16.5.3      YES manual up
R3(config-if)#
R3(config-if)#
R3(config-if)#
R3(config-if)#
R3(config-if)#
R3(config-if)#
R3(config-if)#
R3(config-if)#router ospf 1
R3(config-router)#network 10.10.10.0 0.0.0.255 area 0
R3(config-router)#network 192.168.3.0 0.0.0.255 area 2
R3(config-router)#
R3(config-router)#
R3(config-router)#
R3(config-router)#do ping 192.168.2.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.2.2, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
R3(config-router)#
*Mar  1 00:09:18.123: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.2.2 on FastEthernet0/0 from LOADING to FULL, Loading Done
R3(config-router)#do ping 192.168.2.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.2.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 24/29/32 ms
R3(config-router)#
R3(config-router)#
R3(config-router)#router bgp 65200
R3(config-router)#redistribute ospf 1
R3(config-router)#network 172.16.5.0 mask 255.255.255.0
R3(config-router)#neighbor 172.16.5.1 remote-as 65100
R3(config-router)#neighbor 10.10.10.2 remote-as 65200
R3(config-router)#do sh ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

     172.16.0.0/24 is subnetted, 1 subnets
C       172.16.5.0 is directly connected, Serial1/1
     10.0.0.0/24 is subnetted, 1 subnets
C       10.10.10.0 is directly connected, FastEthernet0/0
O IA 192.168.2.0/24 [110/20] via 10.10.10.2, 01:23:58, FastEthernet0/0
C    192.168.3.0/24 is directly connected, FastEthernet0/1
R3(config-router)#
*Mar  1 01:33:22.495: %BGP-5-ADJCHANGE: neighbor 10.10.10.2 Up
R3(config-router)#
R3(config-router)#
R3(config-router)#do ping 192.168.3.3

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.3.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/3/4 ms
R3(config-router)#
*Mar  1 01:33:33.583: %BGP-5-ADJCHANGE: neighbor 172.16.5.1 Up
R3(config-router)#
